spec/fixtures/sample_requests/globalweather/get_cities_by_country_bad.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
  <soapenv:Header/>
  <soapenv:Body>
    <web:GetCitiesByCountry>
      <!-- Invalid element name -->
      <web:Country>United States</web:Country>
    </web:GetCitiesByCountry>
  </soapenv:Body>
</soapenv:Envelope>
